#### Terraform Plan

<details><summary>Show Plan</summary>

```
data.aws_region.Region: Reading...
data.aws_region.Region: Read complete after 0s [id=us-east-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_lambda_invocation.InitializeTable_Invocation_6E01246F will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_lambda_invocation" "InitializeTable_Invocation_6E01246F" {
      + function_name = "Function-c8e7055b"
      + id            = (known after apply)
      + input         = jsonencode({})
      + result        = (known after apply)
    }

  # aws_api_gateway_deployment.cloudApi_api_deployment_545514BF will be created
  + resource "aws_api_gateway_deployment" "cloudApi_api_deployment_545514BF" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + triggers      = {
          + "redeployment" = "4067b106aab2d8e9f59b16ff863b180cdb8a650f"
        }
    }

  # aws_api_gateway_rest_api.cloudApi_api_2B334D75 will be created
  + resource "aws_api_gateway_rest_api" "cloudApi_api_2B334D75" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + body                         = (known after apply)
      + created_date                 = (known after apply)
      + description                  = (known after apply)
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = -1
      + name                         = "api-c895068c"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)
    }

  # aws_api_gateway_stage.cloudApi_api_stage_BBB283E4 will be created
  + resource "aws_api_gateway_stage" "cloudApi_api_stage_BBB283E4" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "prod"
      + tags_all      = (known after apply)
      + web_acl_arn   = (known after apply)
    }

  # aws_dynamodb_table.VotingAppItems_tfawsdynamodbTableDynamodbTable_21A977CE will be created
  + resource "aws_dynamodb_table" "VotingAppItems_tfawsdynamodbTableDynamodbTable_21A977CE" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "Name"
      + id               = (known after apply)
      + name             = "Table-0e93c191"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "Name"
          + type = "S"
        }
    }

  # aws_iam_role.InitializeTable_Function_IamRole_E3F0843D will be created
  + resource "aws_iam_role" "InitializeTable_Function_IamRole_E3F0843D" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.cloudApi_cloudApi-OnRequest-1174f72e_IamRole_5C0487F1 will be created
  + resource "aws_iam_role" "cloudApi_cloudApi-OnRequest-1174f72e_IamRole_5C0487F1" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.cloudApi_cloudApi-OnRequest-41f14472_IamRole_60C118A3 will be created
  + resource "aws_iam_role" "cloudApi_cloudApi-OnRequest-41f14472_IamRole_60C118A3" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.InitializeTable_Function_IamRolePolicy_2AD89519 will be created
  + resource "aws_iam_role_policy" "InitializeTable_Function_IamRolePolicy_2AD89519" {
      + id     = (known after apply)
      + name   = (known after apply)
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # aws_iam_role_policy.cloudApi_cloudApi-OnRequest-1174f72e_IamRolePolicy_9062CFE8 will be created
  + resource "aws_iam_role_policy" "cloudApi_cloudApi-OnRequest-1174f72e_IamRolePolicy_9062CFE8" {
      + id     = (known after apply)
      + name   = (known after apply)
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # aws_iam_role_policy.cloudApi_cloudApi-OnRequest-41f14472_IamRolePolicy_2728B668 will be created
  + resource "aws_iam_role_policy" "cloudApi_cloudApi-OnRequest-41f14472_IamRolePolicy_2728B668" {
      + id     = (known after apply)
      + name   = (known after apply)
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # aws_iam_role_policy_attachment.InitializeTable_Function_IamRolePolicyAttachment_4435DE19 will be created
  + resource "aws_iam_role_policy_attachment" "InitializeTable_Function_IamRolePolicyAttachment_4435DE19" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.cloudApi_cloudApi-OnRequest-1174f72e_IamRolePolicyAttachment_2304EB12 will be created
  + resource "aws_iam_role_policy_attachment" "cloudApi_cloudApi-OnRequest-1174f72e_IamRolePolicyAttachment_2304EB12" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.cloudApi_cloudApi-OnRequest-41f14472_IamRolePolicyAttachment_73CC9260 will be created
  + resource "aws_iam_role_policy_attachment" "cloudApi_cloudApi-OnRequest-41f14472_IamRolePolicyAttachment_73CC9260" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = (known after apply)
    }

  # aws_lambda_function.InitializeTable_Function_FD00736D will be created
  + resource "aws_lambda_function" "InitializeTable_Function_FD00736D" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "Function-c8e7055b"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs18.x"
      + s3_bucket                      = (known after apply)
      + s3_key                         = "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.18159f1cc4ee3ef6dd23a128dfd8c334.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "WING_FUNCTION_NAME"         = "Function-c8e7055b"
              + "WING_TARGET"                = "tf-aws"
              + "WING_TOKEN_TFTOKEN_TOKEN_1" = "\"Table-0e93c191\""
            }
        }

      + vpc_config {
          + vpc_id = (known after apply)
        }
    }

  # aws_lambda_function.cloudApi_cloudApi-OnRequest-1174f72e_2F82FED3 will be created
  + resource "aws_lambda_function" "cloudApi_cloudApi-OnRequest-1174f72e_2F82FED3" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "cloud-Api-OnRequest-1174f72e-c8de6200"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs18.x"
      + s3_bucket                      = (known after apply)
      + s3_key                         = "asset.c8de6200ddb9f8a3590b097bfde9bdd5326dd904e9.4c8f01f7e110163a6d1e47a3b3034879.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "WING_FUNCTION_NAME"         = "cloud-Api-OnRequest-1174f72e-c8de6200"
              + "WING_TARGET"                = "tf-aws"
              + "WING_TOKEN_TFTOKEN_TOKEN_1" = "\"Table-0e93c191\""
            }
        }

      + vpc_config {
          + vpc_id = (known after apply)
        }
    }

  # aws_lambda_function.cloudApi_cloudApi-OnRequest-41f14472_B4385311 will be created
  + resource "aws_lambda_function" "cloudApi_cloudApi-OnRequest-41f14472_B4385311" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "cloud-Api-OnRequest-41f14472-c81170c6"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs18.x"
      + s3_bucket                      = (known after apply)
      + s3_key                         = "asset.c81170c6eea85213cd98217b95378895ec0689d1c6.370a708f6c134d1a23e636b36d9489f7.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "WING_FUNCTION_NAME"         = "cloud-Api-OnRequest-41f14472-c81170c6"
              + "WING_TARGET"                = "tf-aws"
              + "WING_TOKEN_TFTOKEN_TOKEN_1" = "\"Table-0e93c191\""
            }
        }

      + vpc_config {
          + vpc_id = (known after apply)
        }
    }

  # aws_lambda_permission.cloudApi_api_permission-GET-60cabf0c_3E7E8C53 will be created
  + resource "aws_lambda_permission" "cloudApi_api_permission-GET-60cabf0c_3E7E8C53" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "cloud-Api-OnRequest-41f14472-c81170c6"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromAPIGateway-GET-60cabf0c"
      + statement_id_prefix = (known after apply)
    }

  # aws_lambda_permission.cloudApi_api_permission-POST-cb38ebcb_8FB5CBF5 will be created
  + resource "aws_lambda_permission" "cloudApi_api_permission-POST-cb38ebcb_8FB5CBF5" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "cloud-Api-OnRequest-1174f72e-c8de6200"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromAPIGateway-POST-cb38ebcb"
      + statement_id_prefix = (known after apply)
    }

  # aws_s3_bucket.Code will be created
  + resource "aws_s3_bucket" "Code" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "code-c84a50b1-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_object.InitializeTable_Function_S3Object_F5933D3B will be created
  + resource "aws_s3_object" "InitializeTable_Function_S3Object_F5933D3B" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.18159f1cc4ee3ef6dd23a128dfd8c334.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "assets/InitializeTable_Function_Asset_1A1B5BC3/18159F1CC4EE3EF6DD23A128DFD8C334/archive.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudApi_cloudApi-OnRequest-1174f72e_S3Object_9D8ECEAD will be created
  + resource "aws_s3_object" "cloudApi_cloudApi-OnRequest-1174f72e_S3Object_9D8ECEAD" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "asset.c8de6200ddb9f8a3590b097bfde9bdd5326dd904e9.4c8f01f7e110163a6d1e47a3b3034879.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "assets/cloudApi_cloudApi-OnRequest-1174f72e_Asset_2B0E3465/4C8F01F7E110163A6D1E47A3B3034879/archive.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudApi_cloudApi-OnRequest-41f14472_S3Object_2D3CDD60 will be created
  + resource "aws_s3_object" "cloudApi_cloudApi-OnRequest-41f14472_S3Object_2D3CDD60" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "asset.c81170c6eea85213cd98217b95378895ec0689d1c6.370a708f6c134d1a23e636b36d9489f7.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "assets/cloudApi_cloudApi-OnRequest-41f14472_Asset_83DC60BE/370A708F6C134D1A23E636B36D9489F7/archive.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 22 to add, 0 to change, 0 to destroy.

```

</details>
